In [211]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from sklearn.cluster import MeanShift
from sklearn import preprocessing

In [276]:
data=pd.read_excel('titanic.xls')
original_data=pd.DataFrame.copy(data)
data

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5000,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5000,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0000,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0000,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [277]:
data.drop(['body','name'],1,inplace=True)
data.apply(pd.to_numeric, errors='ignore')
data.fillna(0,inplace=True)
data

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,home.dest
0,1,1,female,29.0000,0,0,24160,211.3375,B5,S,2,"St Louis, MO"
1,1,1,male,0.9167,1,2,113781,151.5500,C22 C26,S,11,"Montreal, PQ / Chesterville, ON"
2,1,0,female,2.0000,1,2,113781,151.5500,C22 C26,S,0,"Montreal, PQ / Chesterville, ON"
3,1,0,male,30.0000,1,2,113781,151.5500,C22 C26,S,0,"Montreal, PQ / Chesterville, ON"
4,1,0,female,25.0000,1,2,113781,151.5500,C22 C26,S,0,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,female,14.5000,1,0,2665,14.4542,0,C,0,0
1305,3,0,female,0.0000,1,0,2665,14.4542,0,C,0,0
1306,3,0,male,26.5000,0,0,2656,7.2250,0,C,0,0
1307,3,0,male,27.0000,0,0,2670,7.2250,0,C,0,0
1308,3,0,male,29.0000,0,0,315082,7.8750,0,S,0,0

In [278]:
def handle_non_numerical_data(data):
    columns=data.columns.values
    for column in columns:
        text_digit_vals={}
        def convert_to_int(val):
            return text_digit_vals[val]
        if data[column].dtype!=np.int64 and data[column].dtype!=np.float64:
            column_contents=data[column].values.tolist()
            unique_elements=set(column_contents)#find uniques
            x=0
            for unique in unique_elements:
                if unique not in text_digit_vals:
                    text_digit_vals[unique]=x
                    x+=1
            data[column]=list(map(convert_to_int,data[column]))
    return data

In [279]:
handle_non_numerical_data(data)

,pclass,survived,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,home.dest
0,1,1,1,29.0000,0,0,754,211.3375,156,3,1,273
1,1,1,0,0.9167,1,2,539,151.5500,148,3,26,185
2,1,0,1,2.0000,1,2,539,151.5500,148,3,0,185
3,1,0,0,30.0000,1,2,539,151.5500,148,3,0,185
4,1,0,1,25.0000,1,2,539,151.5500,148,3,0,185
...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,1,14.5000,1,0,568,14.4542,0,1,0,0
1305,3,0,1,0.0000,1,0,568,14.4542,0,1,0,0
1306,3,0,0,26.5000,0,0,734,7.2250,0,1,0,0
1307,3,0,0,27.0000,0,0,34,7.2250,0,1,0,0
1308,3,0,0,29.0000,0,0,173,7.8750,0,3,0,0

In [280]:
data.drop(['ticket','home.dest'],1,inplace=True)
x=np.array(data.drop(['survived'],1).astype(float))
x=preprocessing.scale(x)
y=np.array(data['survived'])
classifier=MeanShift()
classifier.fit(x)

MeanShift()

In [281]:
labels=classifier.labels_
cluster_centers=classifier.cluster_centers_
original_data['cluster_group']=np.nan
for i, label in enumerate (labels):
    original_data['cluster_group'].iloc[i]=label

D:\Anaconda\envs\python3366\lib\site-packages\pandas\core\indexing.py:670: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  iloc._setitem_with_indexer(indexer, value)

In [282]:
n_clusters_=len(np.unique(labels))
survival_rates={}
for i in range(n_clusters_):
    temp_data=original_data[(original_data['cluster_group']==float(i))]
    survival_cluster=temp_data[(temp_data['survived']==1)]
    survival_rate=len(survival_cluster)/len(temp_data)
    survival_rates[i]=survival_rate
print(survival_rates)

{0: 0.3659539473684211, 1: 0.23809523809523808, 2: 1.0, 3: 0.7636363636363637, 4: 0.0, 5: 1.0, 6: 0.0}

In [305]:
print("First cluster",original_data[(original_data['cluster_group']==0)])

First cluster       pclass  survived                                           name     sex  \
5          1         1                            Anderson, Mr. Harry    male
6          1         1              Andrews, Miss. Kornelia Theodosia  female
7          1         0                         Andrews, Mr. Thomas Jr    male
8          1         1  Appleton, Mrs. Edward Dale (Charlotte Lamson)  female
9          1         0                        Artagaveytia, Mr. Ramon    male
...      ...       ...                                            ...     ...
1304       3         0                           Zabour, Miss. Hileni  female
1305       3         0                          Zabour, Miss. Thamine  female
1306       3         0                      Zakarian, Mr. Mapriededer    male
1307       3         0                            Zakarian, Mr. Ortin    male
1308       3         0                             Zimmerman, Mr. Leo    male

       age  sibsp  parch    ticket     fare cabin embarked boat   body  \
5     48.0      0      0     19952  26.5500   E12        S    3    NaN
6     63.0      1      0     13502  77.9583    D7        S   10    NaN
7     39.0      0      0    112050   0.0000   A36        S  NaN    NaN
8     53.0      2      0     11769  51.4792  C101        S    D    NaN
9     71.0      0      0  PC 17609  49.5042   NaN        C  NaN   22.0
...    ...    ...    ...       ...      ...   ...      ...  ...    ...
1304  14.5      1      0      2665  14.4542   NaN        C  NaN  328.0
1305   NaN      1      0      2665  14.4542   NaN        C  NaN    NaN
1306  26.5      0      0      2656   7.2250   NaN        C  NaN  304.0
1307  27.0      0      0      2670   7.2250   NaN        C  NaN    NaN
1308  29.0      0      0    315082   7.8750   NaN        S  NaN    NaN

                home.dest  cluster_group
5            New York, NY            0.0
6              Hudson, NY            0.0
7             Belfast, NI            0.0
8     Bayside, Queens, NY            0.0
9     Montevideo, Uruguay            0.0
...                   ...            ...
1304                  NaN            0.0
1305                  NaN            0.0
1306                  NaN            0.0
1307                  NaN            0.0
1308                  NaN            0.0

[1216 rows x 15 columns]

In [306]:
print("Second cluster",original_data[(original_data['cluster_group']==1)])

Second cluster       pclass  survived                                               name  \
342        2         1   Becker, Mrs. Allen Oliver (Nellie E Baumgardner)
449        2         1              Hocking, Mrs. Elizabeth (Eliza Needs)
550        2         1              Richards, Mrs. Sidney (Emily Hocking)
626        3         0             Andersson, Miss. Ida Augusta Margareta
629        3         0                        Andersson, Mr. Anders Johan
632        3         0  Andersson, Mrs. Anders Johan (Alfrida Konstant...
644        3         0         Asplund, Mr. Carl Oscar Vilhelm Gustafsson
646        3         1  Asplund, Mrs. Carl Oscar (Selma Augusta Emilia...
660        3         1              Baclini, Mrs. Solomon (Latifa Qurban)
810        3         0                             Ford, Mr. William Neal
811        3         0            Ford, Mrs. Edward (Margaret Ann Watson)
828        3         0                        Goodwin, Miss. Jessie Allis
829        3         0                         Goodwin, Miss. Lillian Amy
831        3         0                     Goodwin, Mr. Charles Frederick
832        3         0            Goodwin, Mrs. Frederick (Augusta Tyler)
958        3         0                      Lefebre, Mrs. Frank (Frances)
1100       3         0        Palsson, Mrs. Nils (Alma Cornelia Berglund)
1106       3         0             Panula, Mrs. Juha (Maria Emilia Ojala)
1146       3         0               Rice, Mrs. William (Margaret Norton)
1210       3         0                                 Skoog, Mr. Wilhelm
1211       3         0    Skoog, Mrs. William (Anna Bernhardina Karlsson)

         sex   age  sibsp  parch      ticket     fare cabin embarked boat  \
342   female  36.0      0      3      230136  39.0000    F4        S   11
449   female  54.0      1      3       29105  23.0000   NaN        S    4
550   female  24.0      2      3       29106  18.7500   NaN        S    4
626   female  38.0      4      2      347091   7.7750   NaN        S  NaN
629     male  39.0      1      5      347082  31.2750   NaN        S  NaN
632   female  39.0      1      5      347082  31.2750   NaN        S  NaN
644     male  40.0      1      5      347077  31.3875   NaN        S  NaN
646   female  38.0      1      5      347077  31.3875   NaN        S   15
660   female  24.0      0      3        2666  19.2583   NaN        C    C
810     male  16.0      1      3  W./C. 6608  34.3750   NaN        S  NaN
811   female  48.0      1      3  W./C. 6608  34.3750   NaN        S  NaN
828   female  10.0      5      2     CA 2144  46.9000   NaN        S  NaN
829   female  16.0      5      2     CA 2144  46.9000   NaN        S  NaN
831     male  40.0      1      6     CA 2144  46.9000   NaN        S  NaN
832   female  43.0      1      6     CA 2144  46.9000   NaN        S  NaN
958   female   NaN      0      4        4133  25.4667   NaN        S  NaN
1100  female  29.0      0      4      349909  21.0750   NaN        S  NaN
1106  female  41.0      0      5     3101295  39.6875   NaN        S  NaN
1146  female  39.0      0      5      382652  29.1250   NaN        Q  NaN
1210    male  40.0      1      4      347088  27.9000   NaN        S  NaN
1211  female  45.0      1      4      347088  27.9000   NaN        S  NaN

       body                                  home.dest  cluster_group
342     NaN         Guntur, India / Benton Harbour, MI            1.0
449     NaN                       Cornwall / Akron, OH            1.0
550     NaN                       Cornwall / Akron, OH            1.0
626     NaN               Vadsbro, Sweden Ministee, MI            1.0
629     NaN                        Sweden Winnipeg, MN            1.0
632     NaN                        Sweden Winnipeg, MN            1.0
644   142.0                      Sweden  Worcester, MA            1.0
646     NaN                      Sweden  Worcester, MA            1.0
660     NaN                         Syria New York, NY            1.0
810     NaN  Rotherfield, Sussex, England Essex Co, MA            1.0
811     NaN  Rotherfield, Sussex, England Essex Co, MA            1.0
828     NaN       Wiltshire, England Niagara Falls, NY            1.0
829     NaN       Wiltshire, England Niagara Falls, NY            1.0
831     NaN       Wiltshire, England Niagara Falls, NY            1.0
832     NaN       Wiltshire, England Niagara Falls, NY            1.0
958     NaN                                        NaN            1.0
1100  206.0                                        NaN            1.0
1106    NaN                                        NaN            1.0
1146  327.0                                        NaN            1.0
1210    NaN                                        NaN            1.0
1211    NaN                                        NaN            1.0

In [310]:
print("Third cluster",original_data[(original_data['cluster_group']==2)])

Third cluster      pclass  survived                                               name  \
49        1         1                 Cardeza, Mr. Thomas Drake Martinez
50        1         1  Cardeza, Mrs. James Warburton Martinez (Charlo...
183       1         1                             Lesurer, Mr. Gustave J
302       1         1                                   Ward, Miss. Anna

        sex   age  sibsp  parch    ticket      fare        cabin embarked  \
49     male  36.0      0      1  PC 17755  512.3292  B51 B53 B55        C
50   female  58.0      0      1  PC 17755  512.3292  B51 B53 B55        C
183    male  35.0      0      0  PC 17755  512.3292         B101        C
302  female  35.0      0      0  PC 17755  512.3292          NaN        C

    boat  body                                       home.dest  cluster_group
49     3   NaN  Austria-Hungary / Germantown, Philadelphia, PA            2.0
50     3   NaN                    Germantown, Philadelphia, PA            2.0
183    3   NaN                                             NaN            2.0
302    3   NaN                                             NaN            2.0

In [307]:
print("Forth cluster",original_data[(original_data['cluster_group']==3)])

Forth cluster       pclass  survived                                               name  \
0          1         1                      Allen, Miss. Elisabeth Walton
1          1         1                     Allison, Master. Hudson Trevor
2          1         0                       Allison, Miss. Helen Loraine
4          1         0    Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
11         1         1  Astor, Mrs. John Jacob (Madeleine Talmadge Force)
17         1         1    Baxter, Mrs. James (Helene DeLaudeniere Chaput)
21         1         1   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)
23         1         1                              Bidois, Miss. Rosalie
24         1         1                                  Bird, Miss. Ellen
28         1         1                             Bissette, Miss. Amelia
32         1         1                            Bonnell, Miss. Caroline
35         1         1                           Bowen, Miss. Grace Scott
44         1         1                    Burns, Miss. Elizabeth Margaret
55         1         1                          Carter, Miss. Lucile Polk
57         1         1          Carter, Mrs. William Ernest (Lucile Polk)
63         1         1  Chaffee, Mrs. Herbert Fuller (Carrie Constance...
66         1         1                        Chaudanson, Miss. Victorine
76         1         1                        Compton, Miss. Sara Rebecca
97         1         1  Douglas, Mrs. Frederick Charles (Mary Helene B...
103        1         1                      Endres, Miss. Caroline Louise
111        1         1                     Fortune, Miss. Alice Elizabeth
112        1         1                         Fortune, Miss. Ethel Flora
113        1         1                         Fortune, Miss. Mabel Helen
114        1         0                     Fortune, Mr. Charles Alexander
129        1         1                               Geiger, Miss. Amalie
155        1         1  Hays, Mrs. Charles Melville (Clara Jennings Gr...
165        1         1                       Hoyt, Mr. Frederick Maxfield
167        1         1    Hoyt, Mrs. Frederick Maxfield (Jane Anne Forby)
180        1         1                             Kreuchen, Miss. Emilie
193        1         1                  Madill, Miss. Georgette Alexandra
207        1         1                             Minahan, Miss. Daisy E
208        1         1    Minahan, Mrs. William Edward (Lillian E Thorpe)
218        1         1                       Oliva y Ocana, Dona. Fermina
238        1         1  Robert, Mrs. Edward Scott (Elisabeth Walton Mc...
249        1         1                        Ryerson, Master. John Borie
250        1         1                         Ryerson, Miss. Emily Borie
251        1         1              Ryerson, Miss. Susan Parker "Suzette"
257        1         1                    Schabert, Mrs. Paul (Emma Mock)
275        1         1  Spedden, Mrs. Frederic Oakley (Margaretta Corn...
277        1         1     Spencer, Mrs. William Augustus (Marie Eugenie)
286        1         0             Straus, Mrs. Isidor (Rosalie Ida Blun)
291        1         1             Taussig, Mrs. Emil (Tillie Mandelbaum)
296        1         1  Thayer, Mrs. John Borland (Marian Longstreth M...
309        1         1                           Wick, Miss. Mary Natalie
311        1         1         Wick, Mrs. George Dennick (Mary Hitchcock)
314        1         1       Widener, Mrs. George Dunton (Eleanor Elkins)
1170       3         0                         Sage, Master. Thomas Henry
1171       3         0                        Sage, Master. William Henry
1172       3         0                                    Sage, Miss. Ada
1173       3         0                       Sage, Miss. Constance Gladys
1174       3         0                  Sage, Miss. Dorothy Edith "Dolly"
1175       3         0                            Sage, Miss. Stella Anna
1176       3         0                           Sage, Mr. Douglas Bullen
1177       3         0                                Sage, Mr. Frederick
1178       3         0                           Sage, Mr. George John Jr

         sex      age  sibsp  parch       ticket      fare            cabin  \
0     female  29.0000      0      0        24160  211.3375               B5
1       male   0.9167      1      2       113781  151.5500          C22 C26
2     female   2.0000      1      2       113781  151.5500          C22 C26
4     female  25.0000      1      2       113781  151.5500          C22 C26
11    female  18.0000      1      0     PC 17757  227.5250          C62 C64
17    female  50.0000      0      1     PC 17558  247.5208          B58 B60
21    female  47.0000      1      1        11751   52.5542              D35
23    female  42.0000      0      0     PC 17757  227.5250              NaN
24    female  29.0000      0      0     PC 17483  221.7792              C97
28    female  35.0000      0      0     PC 17760  135.6333              C99
32    female  30.0000      0      0        36928  164.8667               C7
35    female  45.0000      0      0     PC 17608  262.3750              NaN
44    female  41.0000      0      0        16966  134.5000              E40
55    female  14.0000      1      2       113760  120.0000          B96 B98
57    female  36.0000      1      2       113760  120.0000          B96 B98
63    female  47.0000      1      0  W.E.P. 5734   61.1750              E31
66    female  36.0000      0      0     PC 17608  262.3750              B61
76    female  39.0000      1      1     PC 17756   83.1583              E49
97    female  27.0000      1      1     PC 17558  247.5208          B58 B60
103   female  38.0000      0      0     PC 17757  227.5250              C45
111   female  24.0000      3      2        19950  263.0000      C23 C25 C27
112   female  28.0000      3      2        19950  263.0000      C23 C25 C27
113   female  23.0000      3      2        19950  263.0000      C23 C25 C27
114     male  19.0000      3      2        19950  263.0000      C23 C25 C27
129   female  35.0000      0      0       113503  211.5000             C130
155   female  52.0000      1      1        12749   93.5000              B69
165     male  38.0000      1      0        19943   90.0000              C93
167   female  35.0000      1      0        19943   90.0000              C93
180   female  39.0000      0      0        24160  211.3375              NaN
193   female  15.0000      0      1        24160  211.3375               B5
207   female  33.0000      1      0        19928   90.0000              C78
208   female  37.0000      1      0        19928   90.0000              C78
218   female  39.0000      0      0     PC 17758  108.9000             C105
238   female  43.0000      0      1        24160  211.3375               B3
249     male  13.0000      2      2     PC 17608  262.3750  B57 B59 B63 B66
250   female  18.0000      2      2     PC 17608  262.3750  B57 B59 B63 B66
251   female  21.0000      2      2     PC 17608  262.3750  B57 B59 B63 B66
257   female  35.0000      1      0        13236   57.7500              C28
275   female  40.0000      1      1        16966  134.5000              E34
277   female      NaN      1      0     PC 17569  146.5208              B78
286   female  63.0000      1      0     PC 17483  221.7792          C55 C57
291   female  39.0000      1      1       110413   79.6500              E67
296   female  39.0000      1      1        17421  110.8833              C68
309   female  31.0000      0      2        36928  164.8667               C7
311   female  45.0000      1      1        36928  164.8667              NaN
314   female  50.0000      1      1       113503  211.5000              C80
1170    male      NaN      8      2     CA. 2343   69.5500              NaN
1171    male  14.5000      8      2     CA. 2343   69.5500              NaN
1172  female      NaN      8      2     CA. 2343   69.5500              NaN
1173  female      NaN      8      2     CA. 2343   69.5500              NaN
1174  female      NaN      8      2     CA. 2343   69.5500              NaN
1175  female      NaN      8      2     CA. 2343   69.5500              NaN
1176    male      NaN      8      2     CA. 2343   69.5500              NaN
1177    male      NaN      8      2     CA. 2343   69.5500              NaN
1178    male      NaN      8      2     CA. 2343   69.5500              NaN

     embarked boat  body                        home.dest  cluster_group
0           S    2   NaN                     St Louis, MO            3.0
1           S   11   NaN  Montreal, PQ / Chesterville, ON            3.0
2           S  NaN   NaN  Montreal, PQ / Chesterville, ON            3.0
4           S  NaN   NaN  Montreal, PQ / Chesterville, ON            3.0
11          C    4   NaN                     New York, NY            3.0
17          C    6   NaN                     Montreal, PQ            3.0
21          S    5   NaN                     New York, NY            3.0
23          C    4   NaN                              NaN            3.0
24          S    8   NaN                              NaN            3.0
28          S    8   NaN                              NaN            3.0
32          S    8   NaN                   Youngstown, OH            3.0
35          C    4   NaN                  Cooperstown, NY            3.0
44          C    3   NaN                              NaN            3.0
55          S    4   NaN                    Bryn Mawr, PA            3.0
57          S    4   NaN                    Bryn Mawr, PA            3.0
63          S    4   NaN                       Amenia, ND            3.0
66          C    4   NaN                              NaN            3.0
76          C   14   NaN                     Lakewood, NJ            3.0
97          C    6   NaN                     Montreal, PQ            3.0
103         C    4   NaN                     New York, NY            3.0
111         S   10   NaN                     Winnipeg, MB            3.0
112         S   10   NaN                     Winnipeg, MB            3.0
113         S   10   NaN                     Winnipeg, MB            3.0
114         S  NaN   NaN                     Winnipeg, MB            3.0
129         C    4   NaN                              NaN            3.0
155         S    3   NaN                     Montreal, PQ            3.0
165         S    D   NaN      New York, NY /  Stamford CT            3.0
167         S    D   NaN      New York, NY /  Stamford CT            3.0
180         S    2   NaN                              NaN            3.0
193         S    2   NaN                     St Louis, MO            3.0
207         Q   14   NaN                    Green Bay, WI            3.0
208         Q   14   NaN                  Fond du Lac, WI            3.0
218         C    8   NaN                              NaN            3.0
238         S    2   NaN                     St Louis, MO            3.0
249         C    4   NaN  Haverford, PA / Cooperstown, NY            3.0
250         C    4   NaN  Haverford, PA / Cooperstown, NY            3.0
251         C    4   NaN  Haverford, PA / Cooperstown, NY            3.0
257         C   11   NaN                     New York, NY            3.0
275         C    3   NaN                  Tuxedo Park, NY            3.0
277         C    6   NaN                    Paris, France            3.0
286         S  NaN   NaN                     New York, NY            3.0
291         S    8   NaN                     New York, NY            3.0
296         C    4   NaN                    Haverford, PA            3.0
309         S    8   NaN                   Youngstown, OH            3.0
311         S    8   NaN                   Youngstown, OH            3.0
314         C    4   NaN                  Elkins Park, PA            3.0
1170        S  NaN   NaN                              NaN            3.0
1171        S  NaN  67.0                              NaN            3.0
1172        S  NaN   NaN                              NaN            3.0
1173        S  NaN   NaN                              NaN            3.0
1174        S  NaN   NaN                              NaN            3.0
1175        S  NaN   NaN                              NaN            3.0
1176        S  NaN   NaN                              NaN            3.0
1177        S  NaN   NaN                              NaN            3.0
1178        S  NaN   NaN                              NaN            3.0

In [308]:
print("Fifth cluster",original_data[(original_data['cluster_group']==4)])

Fifth cluster       pclass  survived                            name     sex  age  sibsp  \
1179       3         0           Sage, Mr. John George    male  NaN      1
1180       3         0  Sage, Mrs. John (Annie Bullen)  female  NaN      1

      parch    ticket   fare cabin embarked boat  body home.dest  \
1179      9  CA. 2343  69.55   NaN        S  NaN   NaN       NaN
1180      9  CA. 2343  69.55   NaN        S  NaN   NaN       NaN

      cluster_group
1179            4.0
1180            4.0

In [309]:
print("Sixth cluster",original_data[(original_data['cluster_group']==5)])

Sixth cluster      pclass  survived                                               name  \
78        1         1  Compton, Mrs. Alexander Taylor (Mary Eliza Ing...
116       1         1                Fortune, Mrs. Mark (Mary McDougald)
139       1         1      Graham, Mrs. William Thompson (Edith Junkins)
253       1         1    Ryerson, Mrs. Arthur Larned (Emily Maria Borie)

        sex   age  sibsp  parch    ticket      fare            cabin embarked  \
78   female  64.0      0      2  PC 17756   83.1583              E45        C
116  female  60.0      1      4     19950  263.0000      C23 C25 C27        S
139  female  58.0      0      1  PC 17582  153.4625             C125        S
253  female  48.0      1      3  PC 17608  262.3750  B57 B59 B63 B66        C

    boat  body                        home.dest  cluster_group
78    14   NaN                     Lakewood, NJ            5.0
116   10   NaN                     Winnipeg, MB            5.0
139    3   NaN                    Greenwich, CT            5.0
253    4   NaN  Haverford, PA / Cooperstown, NY            5.0

In [311]:
print("Seventh cluster",original_data[(original_data['cluster_group']==6)])

Seventh cluster      pclass  survived                                  name   sex   age  \
3         1         0  Allison, Mr. Hudson Joshua Creighton  male  30.0
115       1         0                     Fortune, Mr. Mark  male  64.0
215       1         0            Newell, Mr. Arthur Webster  male  58.0
252       1         0            Ryerson, Mr. Arthur Larned  male  61.0
285       1         0                    Straus, Mr. Isidor  male  67.0
312       1         0            Widener, Mr. George Dunton  male  50.0
313       1         0             Widener, Mr. Harry Elkins  male  27.0

     sibsp  parch    ticket      fare            cabin embarked boat   body  \
3        1      2    113781  151.5500          C22 C26        S  NaN  135.0
115      1      4     19950  263.0000      C23 C25 C27        S  NaN    NaN
215      0      2     35273  113.2750              D48        C  NaN  122.0
252      1      3  PC 17608  262.3750  B57 B59 B63 B66        C  NaN    NaN
285      1      0  PC 17483  221.7792          C55 C57        S  NaN   96.0
312      1      1    113503  211.5000              C80        C  NaN    NaN
313      0      2    113503  211.5000              C82        C  NaN    NaN

                           home.dest  cluster_group
3    Montreal, PQ / Chesterville, ON            6.0
115                     Winnipeg, MB            6.0
215                    Lexington, MA            6.0
252  Haverford, PA / Cooperstown, NY            6.0
285                     New York, NY            6.0
312                  Elkins Park, PA            6.0
313                  Elkins Park, PA            6.0